app/controllers/messages_controller.rb

  def index
  	@messages = Message.all
    @users = User.find(:all,:conditions=>['id !=? and status =?',current_user.id,true])
---
SELECT `messages`.* FROM `messages`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

	def create
	  @message = Message.create!(params[:message].permit(:content))
---
INSERT INTO `messages` (`content`, `created_at`, `updated_at`) VALUES ('xx', '2013-08-31 09:29:04', '2013-08-31 09:29:04')