app/controllers/sessions_controller.rb

  def destroy
    debugger
    current_user.update_attribute :status,false
---
UPDATE `users` SET `status` = 0, `updated_at` = '2013-09-02 09:40:28' WHERE `users`.`id` = 2